Revit 2027 API
Space.LightingLoadUnit Property
Get or set the Lighting Load Unit of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BaseLoadOn LightingLoadUnit { get; set; }
Public Property LightingLoadUnit As BaseLoadOn
	Get
	Set
public:
property BaseLoadOn LightingLoadUnit {
	BaseLoadOn get ();
	void set (BaseLoadOn value);
}
member LightingLoadUnit : BaseLoadOn with get, set
Property Value
BaseLoadOn
Remarks
This property is used to get or set the Lighting Load Unit of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace